read_verilog -formal RocketTile_dut.v
prep -top RocketTile
memory -nordff
#memory
hierarchy -check
#async2sync; 
#dffunmap
# setundef -undriven -init -expose
sim -clock clock -reset reset -zinit -rstlen 1 -n 1 -w RocketTile 

write_btor RocketTile_dut.btor