read_verilog -formal RocketTile_dut.v
zinit -all
prep -top RocketTile
chformal -assume -early
memory -nomap
hierarchy -check
# dffunmap
setundef -zero
zinit -all
#sim -clock clock -reset reset -zinit -rstlen 1 -n 1 -w RocketTile 

write_btor RocketTile_dut.btor